init.org
#+PROPERTY: header-args :tangle yes :noweb no-export

* Intro

We want all =emacs-lisp= files to be tangled with the appropriate headers and footers.

- Emacs would like each file to declare its module, and a description.
- All files should use lexical bindings. This makes the code easier to read, and easier for Emacs to interpret, leading to a performance boost.
- Emacs would like each file to declare its end.

#+BEGIN_SRC emacs-lisp
(defun =org-babel-elisp-header-footer ()
  "Add appropriate headers and footers to elisp files."
  (when (and
	 (string-prefix-p (expand-file-name user-emacs-directory) (buffer-file-name))
	 (string-suffix-p ".el" (buffer-file-name)))
    (let ((feature (string-remove-suffix
		    ".el" (string-remove-prefix
			   (expand-file-name user-emacs-directory)
			   (buffer-file-name)))))
      ;; Insert the header
      (goto-char (point-min))
      (insert ";;; " feature ".el --- Tangled from init.org -*- lexical-binding: t; -*-\n"
	      "\n"
	      ";;; Commentary:\n"
	      "\n"
	      ";; This file was tangled as part of iwahbe's Emacs config.\n"
	      "\n"
	      ";;; Code:\n"
	      "\n")
      ;; Then insert the footer
      (goto-char (point-max))
      (insert "\n"
	      "(provide '" feature ")\n"
	      ";;; " feature ".el ends here\n"))
    (let (before-save-hook) (save-buffer))))

(add-hook 'org-babel-post-tangle-hook #'=org-babel-elisp-header-footer)
#+END_SRC

Further, we want lexical bindings even when developing interactively. This doesn't do anything when a file is loaded, but it does effect what happens when =eval-last-sexp= is used.

#+BEGIN_SRC emacs-lisp
(setq lexical-binding t)
#+END_SRC

I declare a custom helper macro for adding hooks. It simplifies quoting, and allows multiple hooks to be attached in a single /sexp/.

#+BEGIN_SRC emacs-lisp
(defmacro =add-hook (mode &rest hooks)
  "Attach multiple HOOKS to a MODE hook.
It is optional to quote MODE."
  (declare (indent defun))
  `(progn
     ,@(mapcar
	(lambda (hook) `(add-hook
			 ,(if (eq (car-safe mode) 'quote)
			      mode
			    `(quote ,mode))
			 ,hook))
	hooks)))
#+END_SRC

==dbg= isn't used within the config, but it proves a helpful pass-through macro for debugging.

#+BEGIN_SRC emacs-lisp
(defmacro =dbg (form)
  "Print FORM => RES where res is what FORM evaluate to.
Return RES."
  `(let ((res ,form)) (message "dbg: %s => %s" '(,@form) res) res))
#+END_SRC


=(==one-of el p1 p2)= is an efficient implementation of =(memq el (list p1 ... pN))= where =p_i= is computed only for the equality check.

#+BEGIN_SRC emacs-lisp
(defmacro =one-of (el &rest forms)
  "Check if EL is one of FORMS.
The nth form in FORMS is evaluated only if no previous form matched EL.
Each form in FORMS is compared against EL with `eq'."
  (let ((name (gensym "el")))
    `(let ((,name ,el))
       (or ,@(mapcar
	      (lambda (form)
		`(eq ,name ,form))
	      forms)))))
#+END_SRC

This expands a function such as =(==one-of (get-input) (comp1) (comp2) (comp3))= into

#+BEGIN_SRC emacs-lisp :tangle no
(let
    ((el6405
      (get-input)))
  (or
   (eq el6405
       (comp1))
   (eq el6405
       (comp2))
   (eq el6405
       (comp3))))
#+END_SRC

* Performance

Emacs Lisp is garbage collected. While this is generally fine, I don't need garbage collection runs kicking off during startup. I disable garbage collection during startup.

It is important that we turn off the GC as early as possible, to save as many cycles as possible.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)
#+END_SRC

We don't want to permanently disable garbage collection, so we re-enable garbage collection after all packages have been loaded.

#+BEGIN_SRC emacs-lisp
(add-hook 'elpaca-after-init-hook
	  (lambda ()
	    (setq gc-cons-threshold 16777216 ; 16mb
		  gc-cons-percentage 0.1)))
#+END_SRC

* Window + Frame Management

A quick glossary for those new to Emacs. Because Emacs predates windowed graphics systems, it uses different terminology then the rest of the world.

In Emacs parlance, the object managed by the OS windowing system is called a *frame*. Each internal pane in a /frame/ is called a *window*.

By default, Emacs thinks in terms of text columns and lines. This isn't great when computing frame sizes for graphical purposes. We want to think in pixels.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(setq frame-resize-pixelwise t)
#+END_SRC

It is important to set graphical elements in =early-init.el=, since otherwise they take effect after graphics open and the window viably flickers or resizes.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(tool-bar-mode -1)
(menu-bar-mode -1)
(setq
 frame-resize-pixelwise t
 ;; We set the font here to work around a bug that hides the echo area
 ;; when a font is set after the frame loads.
 default-frame-alist '((font . "Fira Code")
		       (vertical-scroll-bars . nil)
		       (horizontal-scroll-bars . nil))
 initial-frame-alist
      '((width . 0.5) (height . 1.0)
	(top . 0) (left . 1.0)))
#+END_SRC

* Clutter Management

We want to be able to cleanly check this file in.

We have two complementary strategies for this:

1. We direct what we can into a hidden =.cache=.

#+BEGIN_SRC emacs-lisp
(defvar =cache-directory (expand-file-name ".cache" user-emacs-directory)
  "The directory where a system local cache is stored.")

(defun =cache-subdirectory (domain)
  "A stable directory to cache files from DOMAIN in."
  (expand-file-name (concat domain "/") =cache-directory))

(defun =cache-file (file &optional domain)
  "A stable file name for FILE, located in DOMAIN if provided."
  (expand-file-name file
		    (if domain
			(let ((s (=cache-subdirectory domain)))
			  (unless (file-executable-p s)
			    (mkdir s))
			  s)
		      =cache-directory)))
#+END_SRC

2. We add =.cache= and any un-directed file to =.gitignore=.

#+BEGIN_SRC .gitignore :tangle .gitignore
.cache
#+END_SRC

In theory, it is possible to redirect =.eln= files to an arbitrary location using =startup-redirect-eln-cache=, but it hasn't worked for me.

#+BEGIN_SRC .gitignore  :tangle .gitignore
eln-cache
#+END_SRC

For the record, this is the block I tried:

#+BEGIN_SRC emacs-lisp :file early-init.el :tangle no
(when (fboundp 'startup-redirect-eln-cache)
  (startup-redirect-eln-cache (=cache-subdirectory "eln-cache")))
#+END_SRC

Following good practice, we maintain an =assets= folder, where we store /heavy/ files.

#+BEGIN_SRC emacs-lisp
(defvar =assets-directory (expand-file-name "assets" user-emacs-directory)
  "The directory containing large runtime assets, such as images.")
#+END_SRC

* Package Management

I use [[https://github.com/progfolio/elpaca][elpaca]] as my package manager for Emacs. Like all package managers (except built-in =package.el=, it requires a self-install script to initialize itself.

To avoid cluttering up the =.emacs.d= directory, we have =elpaca= cache in it's own directory.

#+BEGIN_SRC elisp
(defvar elpaca-directory (=cache-subdirectory "elpaca"))
  #+END_SRC

  This is the install script from the elpaca repo:

  #+BEGIN_SRC  elisp
(defvar elpaca-installer-version 0.1)
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
			      :ref nil
			      :files (:defaults (:exclude "extensions"))
			      :build (:not elpaca--activate-package)))
(when-let ((repo  (expand-file-name "repos/elpaca/" elpaca-directory))
	   (build (expand-file-name "elpaca/" elpaca-builds-directory))
	   (order (cdr elpaca-order))
	   ((add-to-list 'load-path (if (file-exists-p build) build repo)))
	   ((not (file-exists-p repo))))
  (condition-case-unless-debug err
      (if-let ((buffer (pop-to-buffer-same-window "*elpaca-installer*"))
	       ((zerop (call-process "git" nil buffer t "clone"
				     (plist-get order :repo) repo)))
	       (default-directory repo)
	       ((zerop (call-process "git" nil buffer t "checkout"
				     (or (plist-get order :ref) "--"))))
	       (emacs (concat invocation-directory invocation-name))
	       ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
				     "--eval" "(byte-recompile-directory \".\" 0 'force)"))))
	  (progn (require 'elpaca)
		 (elpaca-generate-autoloads "elpaca" repo)
		 (kill-buffer buffer))
	(error "%s" (with-current-buffer buffer (buffer-string))))
    ((error) (warn "%s" err) (delete-directory repo 'recursive))))
(require 'elpaca-autoloads)
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
#+END_SRC

Worth noting: =elpaca= runs asynchronously, and kicks off after =after-init-hook=.

We need to disable =package.el=, Emacs's default package manager. Since =package.el= sets up existing packages before =init.el= runs, we need to do this in =early-init.el=:

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(setq package-enable-at-startup nil)
#+END_SRC

