init.el
;;; init.el --- Tangled from init.org -*- lexical-binding: t; -*-

;;; Commentary:

;; This file was tangled as part of iwahbe's Emacs config.

;;; Code:

(defun =org-babel-elisp-header-footer ()
  "Add appropriate headers and footers to elisp files."
  (when (and
	 (string-prefix-p (expand-file-name user-emacs-directory) (buffer-file-name))
	 (string-suffix-p ".el" (buffer-file-name)))
    (let ((feature (string-remove-suffix
		    ".el" (string-remove-prefix
			   (expand-file-name user-emacs-directory)
			   (buffer-file-name)))))
      ;; Insert the header
      (goto-char (point-min))
      (insert ";;; " feature ".el --- Tangled from init.org -*- lexical-binding: t; -*-\n"
	      "\n"
	      ";;; Commentary:\n"
	      "\n"
	      ";; This file was tangled as part of iwahbe's Emacs config.\n"
	      "\n"
	      ";;; Code:\n"
	      "\n")
      ;; Then insert the footer
      (goto-char (point-max))
      (insert "\n"
	      "(provide '" feature ")\n"
	      ";;; " feature ".el ends here\n"))
    (lisp-indent-region (point-min) (point-max))
    (let (before-save-hook) (save-buffer))))

(add-hook 'org-babel-post-tangle-hook #'=org-babel-elisp-header-footer)

(setq-default lexical-binding t)

(defmacro =add-hook (mode &rest hooks)
  "Attach multiple HOOKS to a MODE hook.
It is optional to quote MODE."
  (declare (indent defun))
  `(progn
     ,@(mapcar
	(lambda (hook) `(add-hook
			 ,(if (eq (car-safe mode) 'quote)
			      mode
			    `(quote ,mode))
			 ,hook))
	hooks)))

(defmacro =dbg (form)
  "Print FORM => RES where res is what FORM evaluate to.
Return RES."
  `(let ((res ,form)) (message "dbg: %s => %s" '(,@form) res) res))

(defmacro =one-of (el &rest forms)
  "Check if EL is one of FORMS.
The nth form in FORMS is evaluated only if no previous form matched EL.
Each form in FORMS is compared against EL with `eq'."
  (let ((name (gensym "el")))
    `(let ((,name ,el))
       (or ,@(mapcar
	      (lambda (form)
		`(eq ,name ,form))
	      forms)))))

(add-hook 'elpaca-after-init-hook
	  (lambda ()
	    (setq gc-cons-threshold 16777216 ; 16mb
		  gc-cons-percentage 0.1)))

(defvar =cache-directory (expand-file-name ".cache" user-emacs-directory)
  "The directory where a system local cache is stored.")

(defun =cache-subdirectory (domain)
  "A stable directory to cache files from DOMAIN in."
  (expand-file-name (concat domain "/") =cache-directory))

(defun =cache-file (file &optional domain)
  "A stable file name for FILE, located in DOMAIN if provided."
  (expand-file-name file
		    (if domain
			(let ((s (=cache-subdirectory domain)))
			  (unless (file-executable-p s)
			    (mkdir s))
			  s)
		      =cache-directory)))

(defvar =assets-directory (expand-file-name "assets" user-emacs-directory)
  "The directory containing large runtime assets, such as images.")

(defvar elpaca-directory (=cache-subdirectory "elpaca"))

(defvar elpaca-installer-version 0.1)
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
			      :ref nil
			      :files (:defaults (:exclude "extensions"))
			      :build (:not elpaca--activate-package)))
(when-let ((repo  (expand-file-name "repos/elpaca/" elpaca-directory))
	   (build (expand-file-name "elpaca/" elpaca-builds-directory))
	   (order (cdr elpaca-order))
	   ((add-to-list 'load-path (if (file-exists-p build) build repo)))
	   ((not (file-exists-p repo))))
  (condition-case-unless-debug err
      (if-let ((buffer (pop-to-buffer-same-window "*elpaca-installer*"))
	       ((zerop (call-process "git" nil buffer t "clone"
				     (plist-get order :repo) repo)))
	       (default-directory repo)
	       ((zerop (call-process "git" nil buffer t "checkout"
				     (or (plist-get order :ref) "--"))))
	       (emacs (concat invocation-directory invocation-name))
	       ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
				     "--eval" "(byte-recompile-directory \".\" 0 'force)"))))
	  (progn (require 'elpaca)
		 (elpaca-generate-autoloads "elpaca" repo)
		 (kill-buffer buffer))
	(error "%s" (with-current-buffer buffer (buffer-string))))
    ((error) (warn "%s" err) (delete-directory repo 'recursive))))
(require 'elpaca-autoloads)
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
