init.org
* Splash Screen

Half of customizing Emacs is making the splash screen look fancy.

We redefine =display-startup-echo-area-message=, since there is no built in way to disable it. To make sure I am cognizant of start-up time, I have this set to display the load time of Emacs.

#+BEGIN_SRC emacs-lisp
(defun display-startup-echo-area-message ()
  "Override the default help message by redefining the called function."
  (message "Loaded %s packages in %f seconds"
	   (length (elpaca--queued))
	   (float-time
	    (time-subtract
	     elpaca-after-init-time
	     before-init-time))))
#+END_SRC

I like the simplicity of a random Emacs-related image on screen. I'm not willing to give up on supporting text only situations (such as in the terminal). To that end, there is a fall-back option to display only text.

#+BEGIN_SRC emacs-lisp
(defun =splash-buffer (&optional window)
  "The splash screen.
It is assumed that the splash screen will occupy the whole frame
when it is created.
WINDOW is passed via `window-size-change-functions'.  It is ignored."
  (ignore window)
  (if (not (=one-of (current-buffer)
	    (get-buffer "*scratch*")
	    (get-buffer "*Splash Screen*")))
      ;; If the current buffer is not *scratch*, then Emacs was opened
      ;; onto a file, so we should just display that file.
      (current-buffer)
    (with-current-buffer (get-buffer-create "*Splash Screen*")
      (read-only-mode)
      (make-local-variable 'window-size-change-functions)
      (add-to-list 'window-size-change-functions #'=splash-buffer)
      (let ((inhibit-read-only t))
	(unless (eq (buffer-size) 0)
	  (erase-buffer))
	(if (and (display-graphic-p) (featurep 'image))
	    (=splash-buffer--graphic)
	  (=splash-buffer--text))
	(setq cursor-type nil)
	(goto-char (point-min))
	(setq mode-line-format nil)
	(current-buffer)))))
#+END_SRC

Emacs uses =initial-buffer-choice= to determine what buffer it should start in.

#+BEGIN_SRC emacs-lisp
(setq initial-buffer-choice #'=splash-buffer)
#+END_SRC

** Graphics

Here we want to insert a random image from our list of graphic banner images. Graphic banner images are stored in the =assets= folder. We define our list of images.

#+BEGIN_SRC emacs-lisp
(defvar =emacs-graphic-banners
  (mapcar (lambda (x) (expand-file-name x =assets-directory))
	  '("gnu-head.svg"
	    "emacs-icon.svg"))
  "A list of graphical banners to open Emacs with.
Each element is expected to be the path to a SVG file.")

(defvar =emacs-graphic-banner
  (nth (random (length =emacs-graphic-banners))
       =emacs-graphic-banners)
  "The randomly chosen graphic banner to use for this session.
This is calculated once, so it doesn't change during redisplay.")
#+END_SRC

We then define what a graphic splash buffer will be: A centered image 1/3 down the frame.

#+BEGIN_SRC emacs-lisp
(defun =splash-buffer--graphic ()
  "Display the splash screen with graphics."
  (let* ((img
	  (create-image
	   =emacs-graphic-banner
	   nil nil :width (* (/ (frame-pixel-width) 3) 2)))
	 (img-size (image-size img))
	 (img-width (round (car img-size)))
	 (img-height (round (cdr img-size))))
    ;; We want to center the image around 1/3 down the
    ;; screen. Since the image insert holds the top of the
    ;; image, we need to adjust the insert point by adding
    ;; newlines.
    (insert (make-string (max (- (/ (frame-height) 3) (/ img-height 2)) 0) ?\n))
    ;; Likewise, we want to insert the image in the center of
    ;; the screen but the image inserts from the left. We pad
    ;; our insert point with spaces.
    (insert (make-string (max (- (/ (frame-width) 2) (/ img-width 2)) 0) ? ))
    (insert-image img nil nil nil t)))
    #+END_SRC

** Text

Text banners are stored inline with in =init.el=. They were generated from [[https://patorjk.com/software/taag/#p=display&f=Graffiti&t=Emacs][patorjk.com/software/taag]].

#+BEGIN_SRC emacs-lisp
(defvar =emacs-text-banners
  '(("███████╗███╗   ███╗ █████╗  ██████╗███████╗"
     "██╔════╝████╗ ████║██╔══██╗██╔════╝██╔════╝"
     "█████╗  ██╔████╔██║███████║██║     ███████╗"
     "██╔══╝  ██║╚██╔╝██║██╔══██║██║     ╚════██║"
     "███████╗██║ ╚═╝ ██║██║  ██║╚██████╗███████║"
     "╚══════╝╚═╝     ╚═╝╚═╝  ╚═╝ ╚═════╝╚══════╝")
    ("  _______  ___      ___       __       ______    ________  "
     " /\"     \"||\"  \\    /\"  |     /\"\"\\     /\" _  \"\\  /\"       ) "
     "(: ______) \\   \\  //   |    /    \\   (: ( \\___)(:   \\___/  "
     " \\/    |   /\\\\  \\/.    |   /' /\\  \\   \\/ \\      \\___  \\    "
     " // ___)_ |: \\.        |  //  __'  \\  //  \\ _    __/  \\\\   "
     "(:      \"||.  \\    /:  | /   /  \\\\  \\(:   _) \\  /\" \\   :)  "
     " \\_______)|___|\\__/|___|(___/    \\___)\\_______)(_______/   "))
  "A list of non-graphical banners.
Each banner is expected to be a list of text, where each text
element is a single line.")

(defvar =emacs-text-banner
  (nth (random (length =emacs-text-banners)) =emacs-text-banners)
  "The text banner to use for this session.
This is calculated once so it doesn't change during redisplay")
#+END_SRC

The display function is similar to the graphic version, aiming to put the text centered 1/3 down the frame.

#+BEGIN_SRC emacs-lisp
(defun =splash-buffer--text ()
  "Display the splash screen with only text."
  (let ((banner =emacs-text-banner)
	(empty-line "\n"))
    (dotimes (_ (- (/ (frame-height) 3) (/ (length banner) 2) 2))
      (insert empty-line))
    (mapc (lambda (x) (insert x "\n")) banner))
  (let ((fill-column (frame-width)))
    (center-region (point-min) (point-max))))
#+END_SRC

* UI

I understand what the scratch buffer does, so the explanation is not necessary.

#+begin_src emacs-lisp
(setq initial-scratch-message nil)
#+end_src

I don't need the additional delay of typing "es" or "o". "y" or "n" is sufficient.

#+BEGIN_SRC emacs-lisp
(fset #'yes-or-no-p #'y-or-n-p)
#+END_SRC

Text editors should not make sound.

#+BEGIN_SRC emacs-lisp
(setq ring-bell-function #'ignore)
#+END_SRC

** Theme

Emacs uses a concept called a =theme= to control system appearance. Each theme applies a layer of =face= description to the loaded buffer. The ordered list of enabled themes is defined in =custom-enabled-themes=.

When I load a theme, I only want that theme to apply. I don't want the previous theme to effect the current experience. To solve this, I define a =load-theme= wrapper called ==load-theme=.

#+BEGIN_SRC emacs-lisp
(defun =load-theme (theme)
  "Load THEME without asking for permission."
  (load-theme (pcase theme
		('light 'spacemacs-light)
		('dark 'spacemacs-dark)
		(other other))
	      t)
  ;; Disable previous themes
  (mapc #'disable-theme (cdr custom-enabled-themes)))
#+END_SRC

I'm currently using [[https://github.com/nashamri/spacemacs-theme][spacemacs-theme]], both light and dark as my goto-theme.

#+BEGIN_SRC emacs-lisp
(elpaca spacemacs-theme
#+END_SRC

Mac has a concept of light and dark mode at the system level. Emacs can be built with hooks to support system appearance change. I want use these hooks when available.

#+BEGIN_SRC emacs-lisp
  (if (boundp 'ns-system-appearance)
      (=add-hook ns-system-appearance-change-functions #'=load-theme)
#+END_SRC

When there isn't any system input for the theme, we will just load the ='light= theme by default.

#+BEGIN_SRC emacs-lisp
    (=load-theme 'light)))
#+END_SRC

** Cursor

I expect the cursor to be static, and I prefer a bar over a block.

#+BEGIN_SRC emacs-lisp
(setq-default cursor-type 'bar)
(blink-cursor-mode -1)
#+END_SRC

* Modeline

Current customization is basic, and worth revisiting.

I need to know the line and column number.

#+BEGIN_SRC emacs-lisp
(line-number-mode +1)
(column-number-mode +1)
#+END_SRC

* Introspection

Emacs is famously introspectable. This is facilitated by the =describe-*= functions. The built in introspection is excellent, but it can be improved by showing more information about the values variables hold. The main improvement available is showing the source code where the inspected item is defined. This is what [[https://github.com/Wilfred/helpful][Wilfred/helpful]] does.

#+BEGIN_SRC emacs-lisp
(elpaca helpful
  (global-set-key [remap describe-function] #'helpful-callable)
  (global-set-key [remap describe-key] #'helpful-key)
  (global-set-key [remap describe-variable] #'helpful-variable)
  (global-set-key [remap describe-command] #'helpful-command))
#+END_SRC

Since we are happy with default bindings here, we just remap the existing binding to the =helpful= variant.

* Native compilation

Emacs has support for native compilation of elisp code. This feature leads to a noticeable speedup in performance dependent packages, such as =eglot= and =jsonian=. Emacs compiles elisp code asynchronous in the background when a package is loaded.

We don't want to see compilation errors pop up for existing packages we have, since they are generally not actionable. We instead shunt them into the =*Warnings*= buffer.

#+BEGIN_SRC emacs-lisp
(setq native-comp-async-report-warnings-errors 'silent)
#+END_SRC

* Movement

Emacs defines a multitude of ways to navigate around, but I often find it lacking in certain respects.

** TODO Windows

** Jump to character

One thing I miss from =vim= is the ability to easily jump between and around characters. I have written a small package to accomplish this, called /GoTo Quickly/, and I load that now.

#+BEGIN_SRC emacs-lisp
(load (expand-file-name "gtq.el" user-emacs-directory))
#+END_SRC

It defines =gtq-goto=, which brings up a model interface for quickly navigating among characters.

#+BEGIN_SRC  emacs-lisp
(global-set-key (kbd "C-'") #'gtq-goto)
#+END_SRC

If the package proves useful, I will expand it and probably add more bindings, but right not it's pretty simple.

* Whitespace

Trailing whitespace is generally wrong. However, I need to be careful that I don't have lots of whitespace diffs on shared files. =ws-butler= handles this nicely.

Since the package is unmaintained, I use hlissner's (of Doom Emacs fame) fork, on the grounds that since it is used by a popular distribution, it will probably work.

#+BEGIN_SRC emacs-lisp
(elpaca (ws-butler :host github :repo "hlissner/ws-butler")
#+END_SRC

It is enabled everywhere.

#+BEGIN_SRC emacs-lisp
  (ws-butler-global-mode))
#+END_SRC

I use =fill-paragraph= often. It defaults to /70/ characters, which is too conservative for me.

#+BEGIN_SRC emacs-lisp
(setq-default fill-column 90)
#+END_SRC

