init.org
* Session persistence & Backups

By default, Emacs scatters backup and auto-save files over the directory in use, but does not remember useful information such as where I was last I edited the buffer. This needs to be fixed.

=save-place-mode= is a built-in global minor mode to save the position of point in a buffer, and to persist that between sessions. It does that by writing each buffer position to a file, and then referring to the file when a buffer is revisited. This is fine, but we want to redirect the file to our cache.

#+BEGIN_SRC emacs-lisp
(setq save-place-file (=cache-file "places"))
(save-place-mode +1)
#+END_SRC

I move all auto-saves into a centralized directory that I know is /not/ under source control.

#+BEGIN_SRC emacs-lisp
(setq auto-save-list-file-prefix
      (concat (=cache-subdirectory "auto-save-list") ".saves-"))
#+END_SRC

Similarly, I move all backups to a cache directory.

The ="."= means that this is the backup location for files in all directories.

#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist `(("." . ,(=cache-subdirectory "backup"))))
#+END_SRC

* Project Management

As far as I know, Emacs has two project management solutions: [[https://github.com/bbatsov/projectile][projectile]] and [[https://github.com/emacs-mirror/emacs/blob/master/lisp/progmodes/project.el][project.el]]. Because =project.el= is in-trunk, I have decided to use it. It works out of the box, but I still needed a couple of tweaks.

=project.el= caches which projects have been accessed, which needed to be re-mapped into the cache directory.

#+BEGIN_SRC emacs-lisp
(setq project-list-file (=cache-file "projects"))
#+END_SRC

When a project is entered, =project-switch-commands= is used to determine what dialog is displayed to the user.

Before a switch command is executed, I set =default-directory= to the project I just switched to. This enables commands like =magit= and =vterm= to kick off in the new project.

#+BEGIN_SRC emacs-lisp
(defun =project-set-switch-commands (pallet)
  "Set `project-switch-commands'.

This function alters the commands passed in via PALLET to make
them aware of the new project."
  (setq project-switch-commands
	(mapcar
	 (lambda (x) (cons
		      (lambda ()
			(interactive)
			(let ((default-directory
			       (or project-current-directory-override
				   default-directory)))
			  (funcall-interactively (car x))))
		      (cdr x)))
	 pallet)))
#+END_SRC

We now define the actual command pallet we want.

#+BEGIN_SRC emacs-lisp
(=project-set-switch-commands
      '((project-find-file "Find file" "f")
	(consult-find "`find` file" "C-f")
	(consult-ripgrep "Find regexp" "g")
	(magit "Git" "v")
	(vterm "Shell" "t")))
#+END_SRC

* Completion

A lot of Emacs customization goes into Emacs, which impressively does nothing out of the box.

** Completion at point

For completion at point, there are two main options: [[https://github.com/minad/corfu][corfu]] and [[https://company-mode.github.io][company]]. =company= is by far the 800 pound gorilla in this fight with a large number of custom backends.  I have decided to use =corfu= instead, since it integrates with Emacs's existing =completion-at-point-functions=.

#+BEGIN_SRC emacs-lisp
(elpaca corfu
#+END_SRC

I prefer aggressive completion.

#+BEGIN_SRC emacs-lisp
(setq corfu-auto t          ;; Complete when available
      corfu-auto-delay 0    ;; Without any delay
      corfu-auto-prefix 1)  ;; Wait only for the first character
#+END_SRC

I want completion to be enabled everywhere.

#+BEGIN_SRC emacs-lisp
(global-corfu-mode)
#+END_SRC

Finally, I want completion to not interfere with my normal typing. By default, return finalizes a completion. I find this super disruptive, since I often want to type =RET=, even when a completion is prompted. The solution is to unbind =RET= and rebind a less intrusive option. I use control-space.

This unbinds ="RET"= in the map =corfu= uses during completion. The trailing =t= ensures that we are removing this binding, not just setting it to =nil=. This allows fallback to other keymaps (such as the =self-insert-command= in the =global-mode-map=).

#+BEGIN_SRC emacs-lisp
(define-key corfu-map (kbd "RET") nil t)
#+END_SRC

I then apply the correct bindings for Ctrl-Space. Unfortunately, there doesn't seem to be a binding that applies to both the terminal and the GUI, so I apply a separate binding for both.

#+BEGIN_SRC emacs-lisp
(dolist (spc '("C-@" "C-SPC"))
  ;; C-@ works in the terminal, but not in GUI.
  ;; C-SPC works in GUI, but not in the terminal.
  (define-key corfu-map (kbd spc) #'corfu-insert)))
#+END_SRC

=corfu= only works on a GUI. When I don't have access to a GUI, I load [[https://codeberg.org/akib/emacs-corfu-terminal][corfu-terminal]] to get the graphics to stay consistent.

#+BEGIN_SRC emacs-lisp
(unless (display-graphic-p)
  ;; Since we don't need the additional mode on GUI, only download it
  ;; when on a TTY.
  (elpaca (corfu-terminal
	   :type git
	   :repo "https://codeberg.org/akib/emacs-corfu-terminal.git")
    (corfu-terminal-mode +1)))
#+END_SRC

** TODO Minibuffer completion

#+BEGIN_SRC emacs-lisp
;; A vertical completion framework, applying a nicer UX to default
;; compleating-read style completion.
(elpaca vertico
  (setq vertico-cycle t)
  (vertico-mode))

(elpaca marginalia (marginalia-mode))

(elpaca orderless
  (setq completion-styles '(orderless basic)
	completion-category-overrides '((file (styles basic partial-completion)))))
#+END_SRC

** Enhanced consulting completion

[[https://github.com/minad/consult][consult]] is a utility package that provides a boat load of /improved/ consulting commands. I rebind several existing built-in commands with their =consult= equivalent.

#+BEGIN_SRC emacs-lisp
(elpaca consult
  (global-set-key [remap goto-line] #'consult-goto-line)
  (global-set-key [remap Info-search] #'consult-info)
  (global-set-key [remap yank-pop] #'consult-yank-pop)
  (global-set-key [remap imenu] #'consult-imenu)

  ;; By default, consult applies the prefix ?# to all registers, which
  ;; is not necessary.
  (setq consult-register-prefix nil)

  (global-set-key [remap jump-to-register] #'consult-register-load)
  (global-set-key [remap switch-to-buffer] #'consult-buffer)
  (global-set-key [remap switch-to-buffer-other-frame] #'consult-buffer-other-frame)
  (global-set-key [remap switch-to-buffer-other-window] #'consult-buffer-other-window)
  (define-key isearch-mode-map [remap isearch-edit-string] #'consult-isearch-history))
#+END_SRC

* Major Modes

Emacs defines the general behavior of each buffer with a =major-mode= (stored in a variable of the same name). In general, each language defines a major mode, as well as Emacs specific interaction environments like =dired= and =magit=. Major modes support inheritance, with all modes derived from =fundamental-mode=.

** Text Mode

Text mode is the parent mode for unstructured text.

We want spelling support for text all text modes, so we turn on =flyspell-mode= for =text-mode=. This applies for all derived modes as well.

#+BEGIN_SRC emacs-lisp
(=add-hook 'text-mode-hook
  #'flyspell-mode
  #'visual-line-mode)
#+END_SRC

** Programming Mode

=prog-mode= is for writing structured text for a computer to read (programs). All programming language major modes and most data format major modes are ultimately derived from =prog-mode=.

For programming, we want spellcheck for strings and comments, but not necessarily for all text (such as variable names). Flyspell provides =flyspell-prog-mode= for this purpose.

#+BEGIN_SRC emacs-lisp
(=add-hook prog-mode-hook #'flyspell-prog-mode)
#+END_SRC

Programming languages introduce a new type of error: syntax errors. This is handled by =flymake=, which we enable for all programming languages.

#+BEGIN_SRC emacs-lisp
(=add-hook prog-mode-hook #'flymake-mode)
#+END_SRC

** Emacs Lisp

=emacs-lisp-mode= is the major mode used when editing Emacs lisp. Emacs is already pretty good at editing lisps (kind of it's thing). It is pretty stingy on syntax highlighting though, which is especially painful for a heavily dynamic language. I use [[https://github.com/Fanael/highlight-defined][highlight-defined]] to highlight symbols that are known to be defined in the current session.

By default, =highlight-defined= uses its own set of faces. I don't want to spend the effort to maintain a custom set of faces. Setting =highligh-defined-face-use-itself= restores the default faces. This effectively sets =highlight-defined-${KIND}-name-face= to =font-lock-${KIND}-name-face=.

#+BEGIN_SRC emacs-lisp
(elpaca highlight-defined
  (setq highlight-defined-face-use-itself t) ;; Use standard faces when highlighting.
  (=add-hook emacs-lisp-mode-hook #'highlight-defined-mode))
#+END_SRC

** JSON

I maintain my own major mode for json: =jsonian=. It has some cool features, but the major win is working well in large buffers.

To avoid recomputing strings vs keys, =jsonian= can use existing syntax highlighting as pre-computed indexes. Unfortunately, the Emacs 29 version bump changed how =font-lock= applied, and broke this optimization. I disable it on newer Emacs versions.

#+BEGIN_SRC emacs-lisp
(elpaca jsonian
  (setq jsonian-ignore-font-lock (>= emacs-major-version 29)))
#+END_SRC

** Git

[[https://magit.vc][Magit]] is everyone's favorite git client, and I'm no exception.

#+BEGIN_SRC emacs-lisp
(elpaca magit)
#+END_SRC

I often share code snippets from GitHub repos. It is helpful to be able to link to snippets without going to [[https://github.com][github.com]], and GitHub maintains a stable and easily compute-able link format.

GitHub formats repo links like so:

#+BEGIN_SRC
github.com/${ORG}/${REPO}/blob/${COMMIT-SHA}/${FILE_PATH}#L${LINE_START}[-L${LINE_END}]
#+END_SRC

We can quickly and easily retrieve this information. The =(interactive "r")= tells Emacs that this function should accept the current region when called interactively. We save the generated URL into the =kill-ring=, and print it to the screen.

#+BEGIN_SRC emacs-lisp
(defun =github-code-region (start end)
  "Copy the GitHub permalink of the highlighted region into the `kill-ring'.
Operate on the region defined by START to END."
  (interactive "r")
  (let ((line-start (line-number-at-pos start t))
        (line-end (line-number-at-pos end t))
        (commit (magit-git-string "rev-parse" "--verify" "HEAD"))
        (path (magit-current-file))
        (url (car-safe (magit-config-get-from-cached-list "remote.origin.url"))))
    (unless url
      (user-error "Could not get remote URL"))
    (kill-new
     (format "%s/blob/%s/%s#L%d%s"
             (string-trim-right url (regexp-quote ".git")) commit path line-start
             (if (= line-start line-end)
                 ""
	       (format "-L%d" line-end))))
    (message "Github link to region: %s" (car kill-ring))))
#+END_SRC

