init.el

(setq save-place-file (=cache-file "places"))
(save-place-mode +1)

(setq auto-save-list-file-prefix
      (concat (=cache-subdirectory "auto-save-list") ".saves-"))

(setq backup-directory-alist `(("." . ,(=cache-subdirectory "backup"))))

(setq project-list-file (=cache-file "projects"))

(defun =project-set-switch-commands (pallet)
  "Set `project-switch-commands'.

This function alters the commands passed in via PALLET to make
them aware of the new project."
  (setq project-switch-commands
	(mapcar
	 (lambda (x) (cons
		      (lambda ()
			(interactive)
			(let ((default-directory
			       (or project-current-directory-override
				   default-directory)))
			  (funcall-interactively (car x))))
		      (cdr x)))
	 pallet)))

(=project-set-switch-commands
 '((project-find-file "Find file" "f")
   (consult-find "`find` file" "C-f")
   (consult-ripgrep "Find regexp" "g")
   (magit "Git" "v")
   (vterm "Shell" "t")))

(elpaca corfu

  (setq corfu-auto t          ;; Complete when available
	corfu-auto-delay 0    ;; Without any delay
	corfu-auto-prefix 1)  ;; Wait only for the first character

  (global-corfu-mode)

  (define-key corfu-map (kbd "RET") nil t)

  (dolist (spc '("C-@" "C-SPC"))
    ;; C-@ works in the terminal, but not in GUI.
    ;; C-SPC works in GUI, but not in the terminal.
    (define-key corfu-map (kbd spc) #'corfu-insert)))

(unless (display-graphic-p)
  ;; Since we don't need the additional mode on GUI, only download it
  ;; when on a TTY.
  (elpaca (corfu-terminal
	   :type git
	   :repo "https://codeberg.org/akib/emacs-corfu-terminal.git")
    (corfu-terminal-mode +1)))

;; A vertical completion framework, applying a nicer UX to default
;; compleating-read style completion.
(elpaca vertico
  (setq vertico-cycle t)
  (vertico-mode))

(elpaca marginalia (marginalia-mode))

(elpaca orderless
  (setq completion-styles '(orderless basic)
	completion-category-overrides '((file (styles basic partial-completion)))))

(elpaca consult
  (global-set-key [remap goto-line] #'consult-goto-line)
  (global-set-key [remap Info-search] #'consult-info)
  (global-set-key [remap yank-pop] #'consult-yank-pop)
  (global-set-key [remap imenu] #'consult-imenu)

  ;; By default, consult applies the prefix ?# to all registers, which
  ;; is not necessary.
  (setq consult-register-prefix nil)

  (global-set-key [remap jump-to-register] #'consult-register-load)
  (global-set-key [remap switch-to-buffer] #'consult-buffer)
  (global-set-key [remap switch-to-buffer-other-frame] #'consult-buffer-other-frame)
  (global-set-key [remap switch-to-buffer-other-window] #'consult-buffer-other-window)
  (define-key isearch-mode-map [remap isearch-edit-string] #'consult-isearch-history))

(=add-hook 'text-mode-hook
  #'flyspell-mode
  #'visual-line-mode)

(=add-hook prog-mode-hook #'flyspell-prog-mode)

(=add-hook prog-mode-hook #'flymake-mode)

(elpaca highlight-defined
  (setq highlight-defined-face-use-itself t) ;; Use standard faces when highlighting.
  (=add-hook emacs-lisp-mode-hook #'highlight-defined-mode))

(elpaca jsonian
  (setq jsonian-ignore-font-lock (>= emacs-major-version 29)))

(elpaca magit)

(defun =github-code-region (start end)
  "Copy the GitHub permalink of the highlighted region into the `kill-ring'.
Operate on the region defined by START to END."
  (interactive "r")
  (let ((line-start (line-number-at-pos start t))
        (line-end (line-number-at-pos end t))
        (commit (magit-git-string "rev-parse" "--verify" "HEAD"))
        (path (magit-current-file))
        (url (car-safe (magit-config-get-from-cached-list "remote.origin.url"))))
    (unless url
      (user-error "Could not get remote URL"))
    (kill-new
     (format "%s/blob/%s/%s#L%d%s"
             (string-trim-right url (regexp-quote ".git")) commit path line-start
             (if (= line-start line-end)
                 ""
	       (format "-L%d" line-end))))
    (message "Github link to region: %s" (car kill-ring))))
