init.org
*** Transient

Magit handles it's lovely UX with a subsidiary package: [[https://github.com/magit/transient][transient]], which caches its history locally. We need to remap this into =.cache= to keep =.emacs.d= clean. We don't need to =require= transient ourselves, since Magit depends on it.

#+BEGIN_SRC emacs-lisp
;; Transient does not define it's own history dir, so we do it ourselves.
(defvar =transient-cache-dir (=cache-subdirectory "transient")
  "The directory where transient history files are stored.")
(setq
 transient-history-file (expand-file-name "history.el" =transient-cache-dir)
 transient-values-file (expand-file-name "values.el" =transient-cache-dir)
 transient-levels-file (expand-file-name "levels.el" =transient-cache-dir))
#+END_SRC

** Org Mode

[[https://orgmode.org][org-mode]] is a staple of Emacs, providing a todo list, calendar, literate programming environment and much more. =org-mode= comes built-in to Emacs, but I think it's worth opting into a more developed version.

#+BEGIN_SRC emacs-lisp
(elpaca org)
#+END_SRC

=org-mode= is structured around putting all your =.org= files into a single directory. It isn't required, but I generally do it anyway. The default value is =~/org=, but I prefer =~/Documents/org=, since it is synced by iCloud. This makes my =.org= files accessible on my iPhone and iPad.

#+BEGIN_SRC emacs-lisp
(setq org-directory "~/Documents/org"
      org-id-locations-file (=cache-file "id-locations" "org"))
#+END_SRC

*** Readability

=org-mode= is primarily used for reading, so it's worth making it look as nice as possible.

I hide markup text such as =*=, =/= and ===.

#+BEGIN_SRC emacs-lisp
(setq org-hide-emphasis-markers t)
#+END_SRC

Similarly, we can render pretty equations like =(\alpha - \beta) \div \Omega=.

#+BEGIN_SRC emacs-lisp
(setq org-pretty-entities t)
#+END_SRC

I replace stand org bullets with graphical overlays.

#+BEGIN_SRC emacs-lisp
(elpaca org-bullets (=add-hook org-mode-hook #'org-bullets-mode))
#+END_SRC

I would prefer that org is read with variable width text, but I need source blocks and tables to be rendered with fixed width text. This can be accomplished by overriding org text properties.

This solution was inspired by [[https://zzamboni.org/post/beautifying-org-mode-in-emacs/][zzamboni]].

#+BEGIN_SRC emacs-lisp
(custom-theme-set-faces
 'user
 '(variable-pitch ((t (:family "Helvetica"))))
 '(fixed-pitch ((t ( :family "Fira Code Retina"))))
 '(org-block ((t (:inherit fixed-pitch))))
 '(org-code ((t (:inherit (shadow fixed-pitch)))))
 '(org-document-info ((t (:foreground "dark orange"))))
 '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
 '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
 '(org-link ((t (:foreground "royal blue" :underline t))))
 '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-property-value ((t (:inherit fixed-pitch))) t)
 '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
 '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
 '(org-verbatim ((t (:inherit (shadow fixed-pitch))))))
#+END_SRC

I can now safely enable variable pitch mode.

#+BEGIN_SRC emacs-lisp
(=add-hook org-mode-hook #'variable-pitch-mode)
#+END_SRC

*** Org as a ToDo App

=org-mode= defines a =TODO= item as any header that begins with a todo /keyword/.  The keywords are defines as so.

#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
      '((sequence "TODO(t)" "WAIT(w)" "DONE(d)")
	(type "PROJ(p)")
	(type "KILL(k)")
	(type "LOOP(l)")))
#+END_SRC

I want to leave a small note every time a =TODO= changes state.

#+BEGIN_SRC emacs-lisp
(setq org-log-done 'note)
#+END_SRC

*** Org Agenda

=org-agenda= is a component of =org-mode= that displays =TODO= elements as part of a time view.

I scatter =TODO= elements all over my org files, so I need to tell =org-mode= which directories it should search through.

#+BEGIN_SRC emacs-lisp
(setq org-agenda-files (list org-directory))
#+END_SRC

I generally use it to discover what I need to do this week, so I tell it to work in increments of a week.

#+BEGIN_SRC emacs-lisp
(setq org-agenda-span 'week)
#+END_SRC

*** Source Blocks

Org allows embedded source blocks, framed by =#+BEGIN_SRC= and =#+END_SRC=.

By default, they are indented, but this is confusing since it doesn't match other text (which is not). I disable source indentation:

#+BEGIN_SRC emacs-lisp
(setq org-src-preserve-indentation t)
#+END_SRC

*** Org Roam

Org-roam is a [[https://en.wikipedia.org/wiki/Zettelkasten][zettelkasten]] based notes system. It is an extension to =org-mode=.

#+BEGIN_SRC emacs-lisp
(elpaca org-roam
  (setq org-roam-directory (expand-file-name "roam" org-directory)
	org-roam-db-location (=cache-file "roam.db" "org"))
  ;; `org-roam-node-list' is called before a list of nodes is displayed to the user. We
  ;; use it as a prompt to turn on database syncing without slowing down startup.
  (advice-add #'org-roam-node-list :before (lambda (&rest _) (org-roam-db-autosync-mode +1))))
#+END_SRC
*** Utilities

This is a utility function to resolve GH links to their issue name.

TODO Combine ==org-describe-link= with =org-link-make-description-function= to get the desired behavior by default.

#+BEGIN_SRC emacs-lisp
(defun =org-describe-link ()
  "Heuristically add a description to the `org-mode' link at point."
  (interactive)
  (when-let* ((ctx (org-element-context))
              (type (org-element-type ctx))
	      (link (org-element-property :raw-link ctx))
	      (description (pcase link
			     ;; This is an https: link to a github issue, so we can use
			     ;; `gh` to get the issue title and display that as the
			     ;; description.
			     ((pred (string-match
				     "https://github.com/\\([-a-zA-Z0-9]+\\)/\\([-a-zA-Z0-9]+\\)/issues/\\([0-9]+\\)"))
			      (with-temp-buffer
				(unless (equal 0
					       (call-process
						(executable-find "gh") nil t nil
						"issue" "view" (substring link (match-beginning 3) (match-end 3))
						(concat "--repo="
							(substring link (match-beginning 1) (match-end 1))
							"/"
							(substring link (match-beginning 2) (match-end 2)))
						"--json=title"))
				  (user-error "Failed to get title from GH"))
				(goto-char (point-min))
				(alist-get 'title (json-parse-buffer :object-type 'alist))))
			     ;; Unable to describe link, so let the user do it
			     (_
			      (message "No option matched to describe the link at point: %s" link)
			      nil))))
    (save-excursion
      (delete-region (org-element-property :begin ctx)
		     (org-element-property :end ctx))
      (org-insert-link link link description))))
#+END_SRC

** Terminal

There are quite a few different terminal emulators for Emacs, from the built in =term= to the fully Emacs Lisp based shell =eshell=. I prefer [[https://github.com/akermu/emacs-libvterm][vterm]], an Emacs integration of the [[https://launchpad.net/libvterm][libvterm]] C99 library. It acts as a fully function unconstrained terminal, just like =Termnial.app= or [[https://github.com/alacritty/alacritty][Alacritty]].

#+BEGIN_SRC emacs-lisp
(elpaca vterm
  <<defun-term>>)
#+END_SRC

=vterm= isn't project aware, but I would prefer that it was. This can be accomplished by advising the =vterm= function.

#+NAME: defun-term
#+BEGIN_SRC emacs-lisp
(defun =advice--vterm (fn &rest args)
  "Advice for `vterm'.
Redirect the `default-directory' of `vterm' to be project aware.
Fix the naming of the resulting buffer to be project unique.

FN is the original `vterm' function.
ARGS are it's arguments."
  (if-let ((project (project-current)))
      (let ((default-directory (project-root project))
	    (vterm-buffer-name (concat "*vterm<" (project-name project) ">*")))
	(apply fn args))
    (apply fn args)))
(advice-add #'vterm :around #'=advice--vterm)
#+END_SRC

We ensure that =vterm= buffers are cleaned up when they are a part of a project by adding them to =project-kill-buffers=.

#+NAME: kill-vterm
#+BEGIN_SRC emacs-lisp
(require 'project)
(add-to-list 'project-kill-buffer-conditions
	     '(and
	       (derived-mode . vterm-mode)
	       "^\\*vterm<.*>\\*$"))
#+END_SRC

It is possible to integrate Emacs's =default-directory= with =vterm=, but it requires shell side support. Specifically, the running shell needs to =source= a file that =vterm= includes. We make this easier by projecting that file into =vterm='s environment.

#+BEGIN_SRC emacs-lisp
(setq vterm-environment
      (list (concat "VTERM_DATA="
		    (expand-file-name "repos/emacs-libvterm/etc/emacs-vterm-zsh.sh"
				      elpaca-directory))))
#+END_SRC

I then utilize this variable in my =.zshrc= file:

#+BEGIN_SRC zsh :tangle no
if [[ "$INSIDE_EMACS" = vterm ]]; then
    src="$VTERM_DATA"
    if [[ -f "$src" ]]; then
        source "$src"
    else
        echo "Could not find vterm fish file to source: $src"
    fi
fi
#+END_SRC

** Go

I need a major mode: =go-mode=.

#+BEGIN_SRC emacs-lisp
(elpaca go-mode)
#+END_SRC

 I hook up =eglot= for serving =lsp= and a format on save hook.

#+BEGIN_SRC emacs-lisp
(=add-hook go-mode-hook
  #'eglot-ensure
  (lambda () (add-hook 'before-save-hook #'gofmt-before-save nil t)))
#+END_SRC

** Markdown

=markdown-mode= provides Markdown support.

#+BEGIN_SRC emacs-lisp
(elpaca markdown-mode
#+END_SRC

This snippet automatically activates =markdown-mode= for files ending in =.markdown=, =.md=.

#+BEGIN_SRC emacs-lisp
  (autoload 'markdown-mode "markdown-mode"
    "Major mode for editing Markdown files" t)
  (add-to-list 'auto-mode-alist '("\\.markdown\\'" . markdown-mode))
  (add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
#+END_SRC

Because GitHub is so dominant, I assume that any =README.md= is going in GitHub, and use GitHub Flavored Markdown (GFM). I'm not sure if I intend to keep this snippet, but it was recommended by =markdown-mode='s website.

#+BEGIN_SRC emacs-lisp
  (autoload 'gfm-mode "markdown-mode"
    "Major mode for GitHub Flavored Markdown files" t)
  (add-to-list 'auto-mode-alist '("README\\.md\\'" . gfm-mode)))
#+END_SRC

** YAML

#+BEGIN_SRC emacs-lisp
(elpaca yaml-mode)
#+END_SRC

