init.el

;; Transient does not define it's own history dir, so we do it ourselves.
(defvar =transient-cache-dir (=cache-subdirectory "transient")
  "The directory where transient history files are stored.")
(setq
 transient-history-file (expand-file-name "history.el" =transient-cache-dir)
 transient-values-file (expand-file-name "values.el" =transient-cache-dir)
 transient-levels-file (expand-file-name "levels.el" =transient-cache-dir))

(elpaca org)

(setq org-directory "~/Documents/org"
      org-id-locations-file (=cache-file "id-locations" "org"))

(setq org-hide-emphasis-markers t)

(setq org-pretty-entities t)

(elpaca org-bullets (=add-hook org-mode-hook #'org-bullets-mode))

(custom-theme-set-faces
 'user
 '(variable-pitch ((t (:family "Helvetica"))))
 '(fixed-pitch ((t ( :family "Fira Code Retina"))))
 '(org-block ((t (:inherit fixed-pitch))))
 '(org-code ((t (:inherit (shadow fixed-pitch)))))
 '(org-document-info ((t (:foreground "dark orange"))))
 '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
 '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
 '(org-link ((t (:foreground "royal blue" :underline t))))
 '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-property-value ((t (:inherit fixed-pitch))) t)
 '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
 '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
 '(org-verbatim ((t (:inherit (shadow fixed-pitch))))))

(=add-hook org-mode-hook #'variable-pitch-mode)

(setq org-todo-keywords
      '((sequence "TODO(t)" "WAIT(w)" "DONE(d)")
	(type "PROJ(p)")
	(type "KILL(k)")
	(type "LOOP(l)")))

(setq org-log-done 'note)

(setq org-agenda-files (list org-directory))

(setq org-agenda-span 'week)

(setq org-src-preserve-indentation t)

(elpaca org-roam
  (setq org-roam-directory (expand-file-name "roam" org-directory)
	org-roam-db-location (=cache-file "roam.db" "org"))
  ;; `org-roam-node-list' is called before a list of nodes is displayed to the user. We
  ;; use it as a prompt to turn on database syncing without slowing down startup.
  (advice-add #'org-roam-node-list :before (lambda (&rest _) (org-roam-db-autosync-mode +1))))

(defun =org-describe-link ()
  "Heuristically add a description to the `org-mode' link at point."
  (interactive)
  (when-let* ((ctx (org-element-context))
              (type (org-element-type ctx))
	      (link (org-element-property :raw-link ctx))
	      (description (pcase link
			     ;; This is an https: link to a github issue, so we can use
			     ;; `gh` to get the issue title and display that as the
			     ;; description.
			     ((pred (string-match
				     "https://github.com/\\([-a-zA-Z0-9]+\\)/\\([-a-zA-Z0-9]+\\)/issues/\\([0-9]+\\)"))
			      (with-temp-buffer
				(unless (equal 0
					       (call-process
						(executable-find "gh") nil t nil
						"issue" "view" (substring link (match-beginning 3) (match-end 3))
						(concat "--repo="
							(substring link (match-beginning 1) (match-end 1))
							"/"
							(substring link (match-beginning 2) (match-end 2)))
						"--json=title"))
				  (user-error "Failed to get title from GH"))
				(goto-char (point-min))
				(alist-get 'title (json-parse-buffer :object-type 'alist))))
			     ;; Unable to describe link, so let the user do it
			     (_
			      (message "No option matched to describe the link at point: %s" link)
			      nil))))
    (save-excursion
      (delete-region (org-element-property :begin ctx)
		     (org-element-property :end ctx))
      (org-insert-link link link description))))

(elpaca vterm
  (defun =advice--vterm (fn &rest args)
    "Advice for `vterm'.
  Redirect the `default-directory' of `vterm' to be project aware.
  Fix the naming of the resulting buffer to be project unique.
  
  FN is the original `vterm' function.
  ARGS are it's arguments."
    (if-let ((project (project-current)))
        (let ((default-directory (project-root project))
  	      (vterm-buffer-name (concat "*vterm<" (project-name project) ">*")))
  	  (apply fn args))
      (apply fn args)))
  (advice-add #'vterm :around #'=advice--vterm))

(defun =advice--vterm (fn &rest args)
  "Advice for `vterm'.
Redirect the `default-directory' of `vterm' to be project aware.
Fix the naming of the resulting buffer to be project unique.

FN is the original `vterm' function.
ARGS are it's arguments."
  (if-let ((project (project-current)))
      (let ((default-directory (project-root project))
	    (vterm-buffer-name (concat "*vterm<" (project-name project) ">*")))
	(apply fn args))
    (apply fn args)))
(advice-add #'vterm :around #'=advice--vterm)

(require 'project)
(add-to-list 'project-kill-buffer-conditions
	     '(and
	       (derived-mode . vterm-mode)
	       "^\\*vterm<.*>\\*$"))

(setq vterm-environment
      (list (concat "VTERM_DATA="
		    (expand-file-name "repos/emacs-libvterm/etc/emacs-vterm-zsh.sh"
				      elpaca-directory))))

(elpaca go-mode)

(=add-hook go-mode-hook
  #'eglot-ensure
  (lambda () (add-hook 'before-save-hook #'gofmt-before-save nil t)))

(elpaca markdown-mode

  (autoload 'markdown-mode "markdown-mode"
    "Major mode for editing Markdown files" t)
  (add-to-list 'auto-mode-alist '("\\.markdown\\'" . markdown-mode))
  (add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))

  (autoload 'gfm-mode "markdown-mode"
    "Major mode for GitHub Flavored Markdown files" t)
  (add-to-list 'auto-mode-alist '("README\\.md\\'" . gfm-mode)))

(elpaca yaml-mode)
